## Task 1
A. Import pandas with an alias pd.

B. Prepare a dataframe 'authors' with columns 'author_id' и 'author_name', containg values: [1, 2, 3] и ['Turgenev', 'Chekhov', 'Ostrovsky'].

C. Prepare a dataframe 'book' with columns 'author_id', 'book_title' 'price', containing values: [1, 1, 1, 2, 2, 3, 3], ['Fathers and Sons', 'Rudin', 'Home of the Gentry', 'Fat and Thin', 'The Lady with the Dog', 'The Storm', 'Talents and Admirers'], [450, 300, 350, 500, 450, 370, 290].

In [24]:
import pandas as pd
authors = pd.DataFrame({'author_id':[1,2,3],
                        'author_name':['Turgenev', 'Chekhov', 'Ostrovsky']})
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Fathers and Sons', 'Rudin', 'Home of the Gentry', 'Fat and Thin', 'The Lady with the Dog', 'The Storm', 'Talents and Admirers'], 
                     'price': [450, 300, 350, 500, 450, 370, 290]})

In [25]:
authors

   author_id author_name
0          1    Turgenev
1          2     Chekhov
2          3   Ostrovsky

In [26]:
books

   author_id             book_title  price
0          1       Fathers and Sons    450
1          1                  Rudin    300
2          1     Home of the Gentry    350
3          2           Fat and Thin    500
4          2  The Lady with the Dog    450
5          3              The Storm    370
6          3   Talents and Admirers    290

## Task 2
Prepare a dataframe 'authors_price', merging dataframes 'authors' 'books' using 'author_id' as an index field.

In [27]:
authors_price = authors.set_index('author_id').join(books.set_index('author_id'))
authors_price

          author_name             book_title  price
author_id
1            Turgenev       Fathers and Sons    450
1            Turgenev                  Rudin    300
1            Turgenev     Home of the Gentry    350
2             Chekhov           Fat and Thin    500
2             Chekhov  The Lady with the Dog    450
3           Ostrovsky              The Storm    370
3           Ostrovsky   Talents and Admirers    290

## Task 3
Create dataframe 'top5', which contains 5 the most expensive books from 'authors_price'.

In [28]:
top5 = authors_price.nlargest(5, 'price')
top5

          author_name             book_title  price
author_id
2             Chekhov           Fat and Thin    500
1            Turgenev       Fathers and Sons    450
2             Chekhov  The Lady with the Dog    450
3           Ostrovsky              The Storm    370
1            Turgenev     Home of the Gentry    350

## Task 5
A. Create dataframe 'authors_stat' based on 'authors_price'.

B. 'authors_stat' dataframe should contain 4 columns: 'author_name', 'min_price', 'max_price' and 'mean_price'.

In [29]:
#this task is solved without 'groupby' method to practice working with raw Series. 
authors_stat = authors_price['author_name'].value_counts()
print(authors_stat)
temp = {}
for i in authors_price['author_name'].drop_duplicates():
    temp[i] = [authors_price[authors_price['author_name'] == i ].price.min(),
                       authors_price[authors_price['author_name'] == i ].price.max(),
                       round(authors_price[authors_price['author_name'] == i ].price.mean(),1)]
authors_stat = pd.DataFrame(temp).T.rename(columns={0:'min_price', 1:'max_price', 2:'mean_price'})
authors_stat.index.name = 'author_name'
authors_stat

Turgenev     3
Chekhov      2
Ostrovsky    2
Name: author_name, dtype: int64

             min_price  max_price  mean_price
author_name
Turgenev         300.0      450.0       366.7
Chekhov          450.0      500.0       475.0
Ostrovsky        290.0      370.0       330.0

## Task 5
Create a 'cover' column in 'authors_price' dataframe, describing whether the book is hardcover or paperback. It should contain values: ['hardcover', 'paperback', 'paperback', 'hardcover', 'hardcover', 'paperback', 'paperback']. Read docstring for pd.pivot_table. 

Calculate total value of books for each author that are hardcover or paperback using pd.pivot_table. The columns should be 'hardcover' and 'paperback' with author'name as indices. Fill NaN values with zeroes. 

Name the dataset as 'book_info' and save it in pickle format as "book_info.pkl". Load dataframe from it and name it as 'book_info2'.

Make sure that dataframes 'book_info' and 'book_info2' are identical.

In [30]:
authors_price['cover'] = ['hardcover', 'paperback', 'paperback', 'hardcover', 'hardcover', 'paperback', 'paperback']

In [31]:
authors_price

          author_name             book_title  price      cover
author_id
1            Turgenev       Fathers and Sons    450  hardcover
1            Turgenev                  Rudin    300  paperback
1            Turgenev     Home of the Gentry    350  paperback
2             Chekhov           Fat and Thin    500  hardcover
2             Chekhov  The Lady with the Dog    450  hardcover
3           Ostrovsky              The Storm    370  paperback
3           Ostrovsky   Talents and Admirers    290  paperback

In [32]:
book_info = pd.pivot_table(authors_price,                           
                           index='author_name', 
                           values='price',
                           columns='cover',
                           aggfunc = 'sum', 
                           fill_value=0)
book_info

cover        hardcover  paperback
author_name
Chekhov            950          0
Ostrovsky            0        660
Turgenev           450        650

In [33]:
book_info.to_pickle('book_info.pkl')
book_info2 = pd.read_pickle('book_info.pkl')
book_info.equals(book_info2)

True